package org.dmdev1.computerScience.loops.practice;

/*
* Задача 2
Написать программу, вычисляющую и отображающую все числа Фибоначчи меньше введённого пользователем целого числа.
Решить двумя способами: с помощью цикла и с помощью рекурсии.
* */

public class Task2_v1 {
    public static void main(String[] args) {
        System.out.println();
    }

}
