Задача 1
Имеются три числа - день, месяц и год, вводимые пользователем с консоли.
Вывести дату следующего дня в формате "День.Месяц.Год".
Учесть переход на следующий месяц, а также следующий год.
Форматирование строки "День.Месяц.Год" вынести в отдельную функцию.

Задача 2
Написать программу, вычисляющую корни квадратного уравнения вида ax ² + bx + c = 0, где a, b и c - целочисленные параметры функции run.

Вывести корни квадратного уравнения на консоль.
Если их два, то перечислить каждый с новой строки в консоли (просто использовать два раза System.out.println).
Если дискриминант отрицательный, вывести на консоль сообщение "нет корней".

При решении создать и использовать следующие функции:

- функция isPositive, определяющая, является ли число положительным

- функция isZero, определяющая, является ли число нулём

- функция discriminant, вычисляющая дискриминант

Обращайте внимание, что параметры все целочисленные, а корни могут иметь дробную часть.